[
    {
      "title": "مبانی بلاکچین",
      "desc": "از تاریخچه پول تا قراردادهای هوشمند! در این بخش، با مفاهیم اساسی بلاکچین، دلیل پیدایش آن، نحوه کار بیتکوین و اتریوم، الگوریتم‌های اجماع، و نقش قراردادهای هوشمند در دنیای غیرمتمرکز آشنا می‌شوید.",
      "presenterId": "متین",
      "time": "1403/12/04 - 16:00",
      "level": 1,
      "details": "برای درک بلاکچین، ابتدا باید بدانیم پول از کجا آمده و چرا دیجیتالی شد؟ در این بخش، از تاریخچه پول تا نیاز به سیستم‌های بانکی و سپس دلایل کنار گذاشتن آن‌ها را بررسی می‌کنیم.\n\nبا وایت‌پیپر بیتکوین آشنا می‌شویم و می‌بینیم که این فناوری چگونه کار می‌کند و چه فلسفه‌ای دارد. سپس به الگوریتم‌های اجماع می‌پردازیم تا بفهمیم بلاکچین چگونه امنیت و شفافیت را بدون نیاز به اعتماد به یک نهاد مرکزی فراهم می‌کند.\n\nدر ادامه، با اتریوم و تفاوت‌های آن با بیتکوین آشنا می‌شویم و به مفهوم قراردادهای هوشمند می‌رسیم—برنامه‌هایی که روی بلاکچین اجرا می‌شوند و دنیای دیجیتال، مالی و غیرمتمرکز را متحول کرده‌اند."
    },
    {
      "title": "بلاکچین؛ تحولی در اعتماد، امنیت و شفافیت",
      "desc": "بلاکچین فراتر از رمزارزها! در این ارائه، به مزایا، کاربردهای واقعی و چالش‌های بلاکچین پرداخته و آینده آن را بررسی می‌کنیم.",
      "presenterId": "چمران",
      "time": "1403/12/07 - 10:00",
      "level": 1,
      "details": "در این ارائه، ابتدا به ویژگی‌های متمایز بلاکچین مانند غیرمتمرکز بودن و اعتمادزدایی اشاره می‌کنیم. سپس مزایای آن، از جمله امنیت، شفافیت، کاهش انحصارطلبی و حذف بروکراسی را بررسی خواهیم کرد.\n\nبا ارائه مثال‌های واقعی، بلاکچین را با سیستم‌های سنتی در بانکداری، بورس، صنعت سرگرمی، NFT و رأی‌گیری مقایسه می‌کنیم. در ادامه، رایج‌ترین انتقادات به بلاکچین، از جمله پیچیدگی، مصرف انرژی و پذیرش کند آن را بررسی کرده و به آن‌ها پاسخ می‌دهیم. در نهایت، نگاهی به آینده بلاکچین خواهیم داشت و کاربردهای جدید این فناوری را پیش‌بینی می‌کنیم."
    },
    {
      "title": "آینده اینترنت بدون واسطه‌ها با Web3",
      "desc": "آینده اینترنت در دستان کاربران! این ارائه به بررسی Web3، تفاوت آن با Web2، و تحول مالکیت و تعامل دیجیتال می‌پردازد.",
      "presenterId": "مهدیه",
      "time": "1403/12/07 - 14:00",
      "level": 2,
      "details": "در این ارائه، با ادامه بررسی کاربردهای بلاکچین، وارد دنیای Web3 می‌شویم—اینترنتی جدید که بر پایه غیرمتمرکز بودن، مالکیت دیجیتال و حذف واسطه‌ها بنا شده است.\n\nWeb3 چگونه کار می‌کند؟ کیف پول‌های دیجیتال، هویت غیرمتمرکز، سازمان‌های خودگردان (DAO) و اقتصاد توکنی چه نقشی در آینده اینترنت دارند؟ تفاوت Web3 با Web2 چیست و چه مزایا و چالش‌هایی دارد؟\n\nدر این ارائه، این پرسش‌ها را بررسی می‌کنیم و مسیر تحول اینترنت را از گذشته تا آینده مرور خواهیم کرد."
    },
    {
      "title": "ارائه‌ ویژه",
      "desc": "منتظر باشید.",
      "presenterId": "سروش",
      "time": "1403/12/07 - 16:00",
      "level": 2,
      "details": "منتظر باشید"
    },
    {
      "title": "ارائه‌ ویژه",
      "desc": "منتظر باشید.",
      "presenterId": "حمیدرضا",
      "time": "1403/12/08 - 16:00",
      "level": 2,
      "details": "منتظر باشید"
    },
    {
      "title": "اثبات سهام در عمل",
      "desc": "ممکانیزم PoS، نحوه کار ولیدیتورها و چالش‌های این مدل را بررسی می‌کنیم.",
      "presenterId": "کیوان کامبخش",
      "time": "1403/12/05 - 16:00",
      "level": 3,
      "details": "در این ارائه، به‌صورت پیشرفته و عملی بررسی می‌کنیم که اثبات سهام (Proof of Stake - PoS) چگونه کار می‌کند و چه تفاوت‌هایی با اثبات کار (Proof of Work - PoW) دارد.\n\nمفاهیمی مانند استیکینگ، ولیدیتورها، اسلشینگ، امنیت شبکه، انتخاب تصادفی، و مدل‌های مختلف PoS را توضیح داده و به چالش‌ها و مزایای این روش می‌پردازیم. همچنین، برخی از مهم‌ترین بلاکچین‌هایی که از PoS استفاده می‌کنند را معرفی کرده و ساختار آن‌ها را بررسی خواهیم کرد.\n\nدر نهایت، نگاهی عملی به فرآیند استیکینگ و نحوه مشارکت در تأمین امنیت شبکه خواهیم داشت."
    },
    {
      "title": "آینده بیتکوین؛ از BitVM تا Covenantها",
      "desc": " مکانیسم‌های فنی، محدودیت‌ها، و تأثیر این فناوری‌ها بر آینده بیتکوین",
      "presenterId": "حمید",
      "time": "1403/12/05 - 14:00",
      "level": 2,
      "details": "با وجود اینکه بیتکوین معماری ساده‌ای دارد، اما همچنان در حال پیشرفت است. در این ارائه، به بررسی راهکارهای نوین برای افزایش قابلیت‌های بیتکوین می‌پردازیم.\n\nاز BitVM به‌عنوان راهی برای اجرای محاسبات پیچیده در بیتکوین بدون نیاز به تغییر در پروتکل، تا Covenantها که امکان کنترل دقیق‌تر خرج شدن کوین‌ها را فراهم می‌کنند—همه این پیشرفت‌ها می‌توانند بیتکوین را از یک سیستم پرداخت ساده به یک پلتفرم قراردادهای هوشمند محدود اما کاربردی تبدیل کنند.\n\nدر این ارائه، به مکانیسم‌های فنی، محدودیت‌ها، و تأثیر این فناوری‌ها بر آینده بیتکوین خواهیم پرداخت."
    },
    {
      "title": "مبانی Zero-Knowledge Proof (ZKP)",
      "desc": " ماثبات بدون افشا؛ چطور چیزی را ثابت کنیم، بدون اینکه چیزی لو برود؟",
      "presenterId": "حسین",
      "time": "1403/12/06 - 14:00",
      "level": 2,
      "details": "اثبات بدون افشا (Zero-Knowledge Proof - ZKP) یکی از مهم‌ترین مفاهیم در رمزنگاری مدرن است که امکان اثبات یک ادعا را بدون فاش کردن اطلاعات اصلی فراهم می‌کند.\n\nدر این ارائه، به‌صورت مفهومی و کاربردی توضیح می‌دهیم که ZKP چگونه کار می‌کند، چه انواعی دارد (مانند ZK-SNARKs و ZK-STARKs)، و چرا برای حریم خصوصی، هویت دیجیتال، و مقیاس‌پذیری بلاکچین اهمیت دارد.\n\nهمچنین، به کاربردهای عملی ZKP در حوزه‌هایی مانند اثبات دانستن رمز عبور بدون لو رفتن آن، تراکنش‌های خصوصی در بلاکچین، و سیستم‌های احراز هویت امن خواهیم پرداخت."
    }
  ]